Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་ལན་གསུམ་དུ་བསྐོར་ནས་སེམས་ཅན་ལ་ཕན་པ་མཛད་དེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: and as the totally and completely awakened Buddha Krakucchanda, he acted for the benefit of beings by thrice turning the wheel of the Dharma in its twelve aspects.

source: ཅིག་ཤོས་ནི་འདོད་པ་ལ་ཞུགས་ཏེ་
en: The other son indulged his desires.

source: བག་མེད་པ་དང་གཞན་གྱི་ཆུང་མ་ལ་བྱི་བྱེད་པ་དང་། སྲོག་གཅོད་པ་བྱེད་པར་གྱུར་ཏེ།
en: He became heedless, committed adultery with the wives of others, and killed beings.

source: དེ་རི་དགས་ཤོར་དུ་སོང་ནས། སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་ཁ་འདོག་པར་བྱེད་དོ། །
en: He would go hunting and kill many thousands of beings.

source: དེར་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཕོ་བྲང་མཛེས་ལྡན་དུ་གཤེགས་ཏེ། ཡབ་སྲས་གདན་འཛོམ་པ་
en: “One day the totally and completely awakened Buddha Krakucchanda traveled to Śobhāvatī, and father and son were reunited.

source: དེའི་ཚེ་མཛེས་ལྡན་ན་རྟེན་ཅིང་བཞུགས་ཏེ། སེམས་ཅན་ལ་ཕན་པ་མཛད་དོ། །
en: During his stay in Śobhāvatī he acted for the benefit of beings.

source: དེ་ནས་དེས་གཅུང་དེ་སྡིག་པའི་ལས་དེ་ལས་བཟློག་ནས། སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་གནས་པར་མཛད་དོ། །
en: He turned his younger brother away from sin and established him in refuge and the fundamental precepts.

source: དེས་ཀྱང་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་གཙུག་ལག་ཁང་བྱས་ནས་
en: “The brother went on to build a monastery that was complete in every respect.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ཕུལ་ཏེ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: He offered it to Buddha Krakucchanda and the rest of the saṅgha of monks, provided for all their needs, and at the time of his death prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: སྟོན་པ་འདི་ལྟ་བུ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease a great teacher such as this one.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Going forth in his doctrine alone, may I cast away all afflictive emotions and manifest arhatship.’

source: དགེ་སློང་དག་ཅི་སྙམ་དུ་སེམས།
en: “O monks, what do you think?

source: དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་རྫོགས་བྱེད་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that young brahmin then is this very Pūraṇa .

source: དེས་དེར་སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་ཁ་བཏག་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ནད་མང་བ་དང་ཚེ་ཐུང་བར་གྱུར་ཏོ། །
en: The act of massacring thousands of beings ripened such that wherever he was born, he was very ill and his life was very short.

source: དེས་དེར་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་གཙུག་ལག་ཁང་བྱས་ནས།
en: The act of building a monastery that was complete in every respect,

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཕུལ་ཏེ་
en: offering it to Buddha Krakucchanda and the rest of the saṅgha of monks,

source: ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: providing for all their needs, and praying at the time of his death,

source: སྟོན་པ་འདི་ལྟ་བུ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །ཡོན་ཏན་འདི་ལྟ་བུ་དག་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: May I please and not displease a teacher such as this one. May I achieve such great virtues as his!’

source: ཅེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ། གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཏེ
en: ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth, and such that he was well proportioned, pleasing to the eye, and beautiful.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་དང་ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Krakucchanda—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་འཁོར་བཞི་པོ་རྣམས་མཆོད་པ་བགྱིད་པར་འགྱུར་ལགས།
en: “What action ripened into his passing into nirvāṇa, and caused him to be venerated by the four retinues?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྨོན་ལམ་བཏབ་པའི་དབང་གིས་གྱུར་ཏོ། །
en: “It came about by the power of his prayers,” replied the Blessed One.

source: འདིས་གང་དུ་སྨོན་ལམ་བཏབ་པ་ལགས།
en: “When did he make these prayers?”

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བ་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་ལས་ཕྱི་ཞིག་ན།
en: there lived a certain householder in Vārāṇasī.

source: དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: “One day his wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: གང་གི་ཚེ་དེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་དེས་ཕ་མ་ལ་གསོལ་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་ནས།
en: When he grew up he found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa, and, having made the request to his parents, went forth in the totally and completely awakened Buddha Kāśyapa’s doctrine.

source: བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: He cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: དེས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་བསམས་པ།
en: “After he attained arhatship, he thought,

source: བདག་གིས་འཁོར་བའི་ལུས་འདིས་བྱ་བ་བྱས་ཟིན་གྱིས།
en: ‘I have done what was before me with this saṃsāric body.

source: མ་ལ་ད་ནི་བདག་ཞི་བའི་དབྱིངས་སུ་འཇུག་པར་བྱའོ་
en: Let me enter the sphere of peace!’

source: སྙམ་དུ་བསམས་ནསའབར་བ་དང་ལམ་མེར་འདུག་པ་དང་ཆར་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ཏེ།
en: Reflecting in this way, he made a miraculous display of fire and light, rain and lightning,

source: ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས།
en: and passed beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates.

source: མཁན་པོས་དེའི་ཕ་མ་ལ་སྦྲན་ཏེ། དེའི་ཕ་མ་གཉིས་དང་མཁན་པོས་སྐུ་གདུང་གི་མཆོད་པ་ཆེན་པོ་བྱས་ནས་
en: “His preceptor informed his parents, and his parents and the preceptor performed an elaborate ritual veneration of his remains.

source: མཁན་པོས་སྨོན་ལམ་བཏབ་པ།
en: His preceptor prayed,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: ཡོན་ཏན་འདི་ལྟ་བུ་དག་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: May I achieve such great virtues.

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་ཡང་བཅོམ་ལྡན་འདས་འཁོར་བཞི་པོ་དང་བཅས་པ་རྣམས་ཀྱིས་མཆོད་པའི་ལས་མཛད་པར་ཤོག་ཅིག་ཅེས་བྱས་སོ། །
en: When I pass into nirvāṇa, may the Blessed One and all the four retinues venerate me.’

source: དགེ་སློང་དག་འདི་ཇི་སྙམ་དུ་སེམས།
en: “O monks, what do you think?

source: དེའི་ཚེ་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་རྫོགས་བྱེད་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that monk then is none other than this very Pūraṇa .

source: དེས་དགྲ་བཅོམ་པ་དེ་ལ་མཆོད་པ་བྱས་ནས་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: The act of performing an elaborate ritual veneration of that arhat and praying ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས། འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་ཡང་འཁོར་བཞི་པོ་རྣམས་ཀྱིས་མཆོད་པའི་ལས་བྱས་སོ།། །།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that he has pleased me, not displeased me, go forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship, and when he passed into nirvāṇa, all the four retinues venerated him.”

source: སྒུར་བུ་གཉིས་ཞེས་བྱ་བ་དེ་ལ།
en: The Person with a Curving Spine: Two Stories

source: སྒུར་བུ་དང་པོ་ནི།
en: The First Story about “The Person with a Curving Spine”

source: དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་
en: When the Blessed One was in in Śrāvastī there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས
en: When the time came for him to marry he took a wife,

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: and they enjoyed themselves and coupled. As they enjoyed themselves and coupled, one day his wife conceived,

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། རིགས་དང་འཐུན་པར་མིང་བཏགས་ཏེ།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་ཁོང་རྩིས་དང་ཤོད་དགོད་པ་དང་།
en: They reared him on milk, yogurt, butter, ghee, and milk solids, and as he grew up he studied letters, tallying, and arithmetic;

source: ལག་རྩིས་དང་དབྱུང་བ་དང་སྦ་བ་དང་དགྲམ་པ་དང་གོས་བརྟག་པ་དང་ནོར་བུ་བརྟག་པ་དང་རིན་པོ་ཆེ་བརྟག་པ་དང་སྤོས་བརྟག་པ་དང་སྨན་བརྟག་པ་དང་གླང་པོ་ཆེ་བརྟག་པ་དང་རྟ་བརྟག་པ་དང་གོ་མཚོན་བརྟག་པ་རྣམས་བསླབས་ཏེ།
en: the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱེའུ་དེ་ནད་ཀྱིས་ཐེབས་ནས་དེའི་རྒྱབ་རླུང་གིས་སྒུར་བུར་བྱས་སོ། །
en: One day the child fell ill and his spine was made to curve by a disorder of his vital energies.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་ཕ་མ་གཉིས་ཤིན་ཏུ་སྡུག་བསྔལ་བར་གྱུར་ནས། དེ་ལ་སྨན་པ་ཐམས་ཅད་དང་ཡོ་བྱད་ཐམས་ཅད་བསོགས་ཏེ་རིམ་གྲོ་བྱས་ཀྱང་སོས་པར་བྱེད་མ་ནུས་སོ། །
en: As soon as they saw this condition his parents became very upset and though they brought healers and provided for all his needs, he could not be healed.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེའི་བློ་སྐྱེས་པ་
en: The thought came to the householder,

source: ཁྱེའུ་འདི་སྨན་པ་ཐམས་ཅད་ཀྱིས་གསོ་མ་ནུས་ཀྱིས།
en: “No healer has been able to heal this child.

source: ད་ནི་ཡོན་གནས་རྣམས་ལ་གསོལ་བ་བཏབ་ན། དེ་དག་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཡིན་པས། དེ་དག་གིས་བདག་གི་བུའི་རྒྱབ་སྔ་མཁོ་བཞིན་དུ་རངས་པར་བྱེད་ནུས་ཀྱང་སྲིད་དོ་
en: But the objects of my veneration are so miraculous and powerful that if I pray to them now, they might be able to make my child’s back straight like before.”

source: སྙམ་དུ་བསམས་ནསདེས་རྫོགས་བྱེད་ལ་སོགས་པ་སྟོན་པ་དྲུག་སྤྱན་དྲངས་ཏེ། རང་གི་ལག་གིས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ནས།
en: With this in mind he invited six teachers— Pūraṇa Kāśyapa and the rest—and by his own hand he contented them with many different kinds of good, wholesome food.

source: རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: Then he bowed down at their feet and beseeched them,

source: ཁྱེད་ནི་འདི་ལྟར་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་ཅི་ཡང་མི་མཁྱེན་པའམ། མི་རྟོགས་པ་མི་མངའ་བ་ལགས་ན།
en: “What could there be, past, present, or future, that does not come under your purview?

source: བདག་གི་བུ་འདི་རླུང་གིས་རྒྱབ་སྒུར་པོར་བགྱིས་པ་དེ་སོས་པར་མཛད་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: My child’s spine has been made to curve by a disorder of his vital energies. I ask you, please heal my child.”

source: དེ་དག་གིས་ཀྱང་དེ་ལ་སྔགས་དང་སྨན་མང་དུ་བྱས་ན། འོན་ཀྱང་སོས་པར་བྱེད་མ་ནུས་སོ། །
en: But though they gave him mantras and medicines, they were not able to heal him.

source: དེ་ནས་ཁྱིམ་བདག་དེའི་མཛའ་བོ་བཤེས་པའི་གྲོགས་པོ་སངས་རྒྱས་པའི་དགེ་བསྙེན་ཞིག་ཡོད་པ་དེས། དེ་ལ་སྨྲས་པ་
en: The householder had a close friend, a Buddhist lay vow holder, who advised him,

source: གྲོགས་པོ་སྐྱབས་མ་ཡིན་པ་འདི་དག་ལ་སྐྱབས་བཙལ་ཏེ་ཅི་བྱ།
en: “My friend, why do you seek refuge in those who are not a refuge?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་སོང་དང་ཁྱོད་ཀྱི་ལེགས་པ་ཐམས་ཅད་མཛད་པར་འགྱུར་རོ། །
en: Take refuge in the Blessed Buddha, and he will do all manner of good things for you.”

source: དེས་སྨྲས་པ་དེ་ཅི་ཤེས་པ་ཞིག་
en: “What does he know?” the householder asked.

source: དགེ་བསྙེན་གྱིས་སྨྲས་པ། དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཡིན་ནོ། །
en: “He is omniscient. He knows everything,” replied the lay vow holder.

source: དེ་ནས་ཁྱིམ་བདག་དེས་ཐོས་མ་ཐག་ཏུ་དགའ་བ་སྐྱེས་སོ། །དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: When he heard this, the householder felt immense joy and approached the Blessed Buddha.

source: ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: When he arrived, he touched his head to the Blessed One’s feet and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དང་འཚམ་པའི་ཆོས་བསྟན་ནས་ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: The Blessed One taught him the Dharma particularly suited to him, then sat in silence.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཏམ་གྱི་མཇུག་རྫོགས་ནས། ཁྱིམ་བདག་དེ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once the Blessed One had completed his teaching, the householder rose from his seat, drew down the right shoulder of his upper garment, and implored the Blessed One,

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་ཁྱིམ་དུ་བཤོས་གསོལ་བར་ཅི་གནང་ཞེས་གསོལ་ཏོ།
en: “Please permit me to request that the Blessed One and the saṅgha of monks take your meal at my house tomorrow.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དེ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to the householder by his silence.

source: དེ་ནས་ཁྱིམ་བདག་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས།
en: Understanding that by his silence the Blessed One had given his assent,

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དེ། རྗེས་སུ་ཡི་རང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: the householder then praised this assurance from the Blessed One, rejoiced, bowed down at his feet, and departed.

source: དེ་ནས་དེས་དེ་ཉིད་ཀྱི་མཚན་མོ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་སྦྱར་ནས་ནང་པར་སྔར་ལངས་ཏེ་གདན་བཤམས་ནས་ཕྱག་ཆབ་ཀྱི་ཆུ་ར་བཀང་སྟེ།
en: After preparing many good, wholesome foods that night, in the morning the householder rose, prepared seats, filled the water pots, and set them out.

source: བཅོམ་ལྡན་འདས་ལ་ཕྲིན་གྱིས་གདུགས་ཚོད་བསྐུལ་བ།
en: Then he reminded the Blessed One that it was time for the midday meal by sending a message that said,

source: བཙུན་པ་གདུགས་ཚོད་ལ་བབ་སྟེ་བཤོས་གསོལ་ལགས་ན།
en: “My lord, the midday meal is upon us.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ད་དེའི་དུས་ལ་བབ་པར་དགོངས་ཏེ་གཤེགས་སུ་གསོལ་ཞེས་བསྐུལ་ཏོ། །
en: Know that the time has come, Blessed One, and your presence is requested.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ།
en: That morning the Blessed One donned his lower garment and Dharma robes,

source: ལྷུང་བཟེད་བསྣམས་ནས། དགེ་སློང་གི་ཚོགས་ཀྱིས་ཞམ་རིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས།
en: and, carrying his alms bowl, he set out surrounded and attended by an assembly of monks.

source: ཁྱིམ་བདག་དེའི་བཀད་ས་ག་ལ་བ་དེར་གཤེགས་པ་དང་ཁྱེའུ་དེས་ཐག་རིང་པོ་ཞིག་ནས་
en: As they arrived at the householder’s reception room, the householder’s son saw the Blessed Buddha from a distance.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ་མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ་མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ། བློ་གསལ་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: The body of the Blessed Buddha, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like a tongue of fire stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels. He was immaculate, clear-minded, and pure of heart.

source: མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ།
en: Upon seeing the Blessed Buddha, the householder’s son was filled with supreme joy,

source: དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་ཅན་གྱིས་དང་པོ་སངས་རྒྱས་མཐོང་བའི་ཉམས་བདེ་བ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་ནི་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཞི་གནས་ཀྱི་སེམས་ལ་གོམས་པར་བྱས་པ་ལ་ཡང་ཉམས་བདེ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: for beings who have gathered the roots of virtue to see a buddha for the first time experience such rapture as is not to be had even by those who practice calm abiding meditation for twelve years.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་ཁྱེའུ་དེ་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་ཏེ། ཤིན་ཏུ་དགའ་བ་སྐྱེས་ནས། དེ་གུས་པར་བསྒྲིམ་པའི་ཚུལ་གྱིས་ཁྲི་ལས་ལངས་སོ། །
en: Filled with such supreme joy at the sight of him, the child respectfully and deliberately stood up from his seat.

source: དེ་ཁྲི་ལས་ལངས་པའི་མོད་ལ་རྒྱབ་སྒུར་བ་དེ་སྔ་མཁོ་བཞིན་དུ་རངས་པར་གྱུར་ཏོ། །
en: No sooner had he risen from his seat than his curving spine became straight as before,

source: དེ་ནས་དེ་ལྷག་པར་ཡང་བཅོམ་ལྡན་འདས་ལ་དགའ་བ་སྐྱེས་སོ། །
en: and he was filled with even more joy toward the Blessed One.

source: དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མཆུས་གཏུགས་ནས་འདི་སྐད་དུ།
en: Full of joy, he approached him, touched his head to the Blessed One’s feet, kissed them, and said,

source: བཅོམ་ལྡན་འདས་ནི་བདག་ལ་དཀའ་བ་མཛད་པའོ། །
en: “Blessed One, what a difficult task you have done for me!

source: བདེ་བར་གཤེགས་པ་ནི། བདག་ལ་དཀའ་བ་མཛད་པའོ་ཞེས་གསོལ་ཏོ། །
en: Sugata, what a difficult task you have done for me!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: Then the Blessed One took his place on the seat prepared for him amid the saṅgha of monks.

source: དེ་ནས་ཁྱིམ་བདག་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་བདེ་བར་བཞུགས་པར་རིག་ནས།
en: Once the householder knew that the Buddha and the rest of the saṅgha of monks were comfortably seated,

source: རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ་ཅི་བཞེད་པ་བསྟབས་སོ། །
en: by his own hand he contented them with many good, wholesome foods, proffering all that they wished.

source: རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་རྣམ་གྲངས་དུ་མས་ཚིམ་པར་བྱས་ཏེ། ཅི་བཞེད་པ་བསྟབས་ནས། བཅོམ་ལྡན་འདས་བཤོས་གསོལ་ལགས་ཏེ། གསང་སྡེར་ནི་གྱུ་ཕྱག་ནི་བཅབས་པར་རིག་ནས།
en: Having by his own hand contented them with many different kinds of good, wholesome food, proffering all that they wished, once he knew that the Blessed One had finished eating and that his bowl had been taken away and his hands washed,

source: ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: he sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended the thoughts, habitual tendencies, temperament, and nature of the householder and his retinue, and taught them the Dharma accordingly.

source: དེ་ཐོས་ནས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པ་དང་ཁྱེའུ་དེས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Hearing it, the householder, his retinue, and the child destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་བདེན་པ་རྣམས་ལ་བཀོད་ནས། ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས། གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: After the Blessed One had established them in the truths and instructed, encouraged, inspired, and delighted the householder with a discourse on the Dharma, he rose from his seat and departed.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱེའུ་དེའི་བློ་སྐྱེས་པ།
en: One day the young man thought,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་རྣམ་པ་དུ་མ་ནི་བསལ། བདེ་བ་དང་ཡིད་བདེ་བ་རྣམ་པ་དུ་མ་ནི་བསྒྲུབས། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་ནི་བསལ། དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་ནི་བསྒྲུབས་ཀྱིས་
en: “The Blessed One has dispelled so many kinds of suffering and anguish, brought me so much happiness and bliss, cleared away so many of my sins and nonvirtues, and secured for me such virtues.

source: བདག་གིས་ཁྱིམ་ན་གནས་པ་བཏང་ལ་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དུ་འགྲོའོ་
en: Let me give up living at home and, in the presence of the Blessed One, go forth to practice the holy life.”

source: སྙམ་དུ་བསམས་ཏེ་ཕ་མ་ལ་གསོལ་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Reflecting in this way, he asked for his parents’ permission and approached the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He touched his head to the Blessed One’s feet, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and made this request of him:

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་ཐོབ་ཏུ་རུང་ན་
en: “Lord, if appropriate, I wish to go forth in the Dharma and Vinaya so well spoken and achieve full ordination as a monk.

source: བདག་ཀྱང་། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འཚལ་ལོ། །
en: In the presence of the Blessed One, I too wish to practice the holy life.”

source: དེ་ནས་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག །ཚངས་པར་སྤྱོད་ཅིག་ཅེས་བཀའ་སྩལ་ནས།
en: “Come, join me, monk!” replied the Blessed One. “Practice the holy life.”

source: ཚིག་དེ་སྐད་ཅེས་བཀའ་སྩལ་པའི་མོད་ལ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཞག་བདུན་ལོན་པ་ཙམ་དུ་གྱུར། སྤྱོད་ལམ་ནི་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པ་ལྟ་བུར་འདུག་པར་གྱུར། ལག་ན་ནི་ལྷུང་བཟེད་དང་། ཆུ་སྣོད་ཐོགས་པར་གྱུར་ཏོ། །
en: As soon as the Blessed One had finished speaking there they stood, alms bowl and water pitcher in hand, with but a week’s worth of hair and beard, and with the deportment of a monk who had been ordained for one hundred years.

source: འདིར་སྨྲས་པ།
en: As it is said:
